# brew command-line tools using Homebrew
# Usage: `brew bundle --file=Brewfile-work`

tap 'blackfireio/homebrew-blackfire'

brew 'docker'
brew 'docker-machine'
brew 'vagrant-completion'
brew 'rsync'
brew 'mysql'

brew 'php71-imagick'
brew 'php71-v8js'

brew 'yarn'
brew 'kubernetes-cli'

brew 'blackfire-agent'

cask 'google-cloud-sdk'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'zeplin'
