# brew command-line tools using Homebrew
# Usage: `brew bundle`

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/completions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# General development stuff
brew 'bash-completion'
brew 'git'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'
brew 'hub'
brew 'ansible'
brew 'curl'
brew 'mongo'
brew 'mongo-orchestration'
brew 'wget'
brew 'cloc'
brew 'mas'

# PHP packages
tap 'homebrew/php'
brew 'php71'
brew 'php71-intl'
brew 'php71-mongodb'
brew 'php71-xdebug'
brew 'composer'

# General casks
cask 'atom'
cask 'gitter'
cask 'moom'
cask 'phpstorm'
cask 'sonos'
cask 'toggldesktop'
cask 'whatpulse'
cask 'whatsapp'
