# brew command-line tools using Homebrew
# Usage: `brew bundle`

tap 'homebrew/dupes'
tap 'homebrew/versions'

# General development stuff
brew 'git'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'
brew 'hub'
brew 'ansible'
brew 'curl'
brew 'mongo'
brew 'mongo-orchestration'
brew 'wget'
brew 'cloc'

# PHP packages
tap 'homebrew/php'
brew 'php70'
brew 'php70-intl'
brew 'php70-mongodb'
brew 'php70-xdebug'
brew 'composer'
